import React from 'react'
import {PageHeader,Button,Icon,Row,Col} from 'antd'
import {Link} from 'react-router-dom'

const PandaSvg = () => (
    <svg viewBox="0 0 1024 1024" width="1em" height="1em" fill="currentColor">
      <path
        d="M99.096 315.634s-82.58-64.032-82.58-132.13c0-66.064 33.032-165.162 148.646-148.646 83.37 11.91 99.096 165.162 99.096 165.162l-165.162 115.614zM924.906 315.634s82.58-64.032 82.58-132.13c0-66.064-33.032-165.162-148.646-148.646-83.37 11.91-99.096 165.162-99.096 165.162l165.162 115.614z"
        fill="#6B676E"
        p-id="1143"
      />
      <path
        d="M1024 561.548c0 264.526-229.23 429.42-512.002 429.42S0 826.076 0 561.548 283.96 66.064 512.002 66.064 1024 297.022 1024 561.548z"
        fill="#FFEBD2"
        p-id="1144"
      />
      <path
        d="M330.324 842.126c0 82.096 81.34 148.646 181.678 148.646s181.678-66.55 181.678-148.646H330.324z"
        fill="#E9D7C3"
        p-id="1145"
      />
      <path
        d="M644.13 611.098C594.582 528.516 561.55 512 512.002 512c-49.548 0-82.58 16.516-132.13 99.096-42.488 70.814-78.73 211.264-49.548 247.742 66.064 82.58 165.162 33.032 181.678 33.032 16.516 0 115.614 49.548 181.678-33.032 29.18-36.476-7.064-176.93-49.55-247.74z"
        fill="#FFFFFF"
        p-id="1146"
      />
      <path
        d="M611.098 495.484c0-45.608 36.974-82.58 82.58-82.58 49.548 0 198.194 99.098 198.194 165.162s-79.934 144.904-148.646 99.096c-49.548-33.032-132.128-148.646-132.128-181.678zM412.904 495.484c0-45.608-36.974-82.58-82.58-82.58-49.548 0-198.194 99.098-198.194 165.162s79.934 144.904 148.646 99.096c49.548-33.032 132.128-148.646 132.128-181.678z"
        fill="#6B676E"
        p-id="1147"
      />
      <path
        d="M512.002 726.622c-30.06 0-115.614 5.668-115.614 33.032 0 49.638 105.484 85.24 115.614 82.58 10.128 2.66 115.614-32.944 115.614-82.58-0.002-27.366-85.556-33.032-115.614-33.032z"
        fill="#464655"
        p-id="1148"
      />
      <path
        d="M330.324 495.484m-33.032 0a33.032 33.032 0 1 0 66.064 0 33.032 33.032 0 1 0-66.064 0Z"
        fill="#464655"
        p-id="1149"
      />
      <path
        d="M693.678 495.484m-33.032 0a33.032 33.032 0 1 0 66.064 0 33.032 33.032 0 1 0-66.064 0Z"
        fill="#464655"
        p-id="1150"
      />
    </svg>
  )
const PandaIcon = props => <Icon component={PandaSvg} {...props} />
var NewsePageCss  = require('./newse.css')
export default class NewsePage extends React.Component{
    render(){
        return(
            <div className={NewsePageCss.all}>
                <PageHeader
                    style={{border: '1px solid rgb(235,237,240)'}}
                    title="志愿新闻"
                    subTitle="针心针意"
                    extra={[
                        <Link to='./news'> <Button key="1">新闻主页</Button></Link>,
                        <Link to='./login'> <Button key="2">登录</Button></Link>,
                        <PandaIcon style={{ fontSize: '32px' }} />                        
                    ]}
                    />
                    <div className={NewsePageCss.title}>
                        <p>前进街“搭台唱戏”，62名志愿者获颁奖牌</p>
                    </div>
                    <div className={NewsePageCss.content1}> 
                    <Row>
                        <Col span={5}></Col>
                        <Col span={14}>
                    <h3>                      
                    “一起走，不需要理由，伸出彼此的双手，传递心中的热流”，12月28日上午，一首传递爱和温暖的手语志愿者之歌在前进街羊城花园
                    社区响起，伴随着悠扬的旋律，50名志愿者整齐划一地表演着手语舞，引起现场数百名社区党员和群众的共鸣，将整场文艺汇演推向高潮。</h3> 
                    <h3>
                    据悉，此次汇演由前进街主办、羊城花园社区承办，旨在通过形式多样的具有民族特色的表演，传承优秀传统文化，凝聚社会价值共
                    识，使民族团结进步价值理念更加深入人心，凝聚磅礴的精神力量。</h3>
                    
                    <h3>
                    活动现场精彩纷呈，一群英姿飒爽的“小女英雄们”带着《花木兰》舞曲拉开了帷幕，她们矫健的身姿、飞旋的舞步尽显“巾帼不让须眉”
                    的精神风貌。与此同时，羊城社区志愿服务队的队员们也带着各自的特长为观众们奉献了葫芦丝合奏、旗袍秀、太极拳等表演。</h3>
                    <h3>
                    活动还特设了一项志愿者表彰环节，前进街相关领导现场为羊城花园有着突出表现的义工们颁发奖牌，其中17位志愿服务时间超过200
                    小时以上的志愿者们获得金牌，20位志愿服务时间在120—200小时之间的志愿者们获得银牌，25位自愿服务在60—120小时之间的志愿者们获得铜牌。</h3>
                    
                    <h2 className={NewsePageCss.footer}>
                    广州日报全媒体文字记者秦松 通讯员孙军辉广州日报全媒体图片记者秦松广州日报全媒体编辑 赵碧莹
                    </h2>
                    </Col>
                    </Row>
                    </div>
            </div>
        )
    }
}