import React from 'react'
import {PageHeader,Button,Icon,Row,Col} from 'antd'
import {Link} from 'react-router-dom'

const PandaSvg = () => (
    <svg viewBox="0 0 1024 1024" width="1em" height="1em" fill="currentColor">
      <path
        d="M99.096 315.634s-82.58-64.032-82.58-132.13c0-66.064 33.032-165.162 148.646-148.646 83.37 11.91 99.096 165.162 99.096 165.162l-165.162 115.614zM924.906 315.634s82.58-64.032 82.58-132.13c0-66.064-33.032-165.162-148.646-148.646-83.37 11.91-99.096 165.162-99.096 165.162l165.162 115.614z"
        fill="#6B676E"
        p-id="1143"
      />
      <path
        d="M1024 561.548c0 264.526-229.23 429.42-512.002 429.42S0 826.076 0 561.548 283.96 66.064 512.002 66.064 1024 297.022 1024 561.548z"
        fill="#FFEBD2"
        p-id="1144"
      />
      <path
        d="M330.324 842.126c0 82.096 81.34 148.646 181.678 148.646s181.678-66.55 181.678-148.646H330.324z"
        fill="#E9D7C3"
        p-id="1145"
      />
      <path
        d="M644.13 611.098C594.582 528.516 561.55 512 512.002 512c-49.548 0-82.58 16.516-132.13 99.096-42.488 70.814-78.73 211.264-49.548 247.742 66.064 82.58 165.162 33.032 181.678 33.032 16.516 0 115.614 49.548 181.678-33.032 29.18-36.476-7.064-176.93-49.55-247.74z"
        fill="#FFFFFF"
        p-id="1146"
      />
      <path
        d="M611.098 495.484c0-45.608 36.974-82.58 82.58-82.58 49.548 0 198.194 99.098 198.194 165.162s-79.934 144.904-148.646 99.096c-49.548-33.032-132.128-148.646-132.128-181.678zM412.904 495.484c0-45.608-36.974-82.58-82.58-82.58-49.548 0-198.194 99.098-198.194 165.162s79.934 144.904 148.646 99.096c49.548-33.032 132.128-148.646 132.128-181.678z"
        fill="#6B676E"
        p-id="1147"
      />
      <path
        d="M512.002 726.622c-30.06 0-115.614 5.668-115.614 33.032 0 49.638 105.484 85.24 115.614 82.58 10.128 2.66 115.614-32.944 115.614-82.58-0.002-27.366-85.556-33.032-115.614-33.032z"
        fill="#464655"
        p-id="1148"
      />
      <path
        d="M330.324 495.484m-33.032 0a33.032 33.032 0 1 0 66.064 0 33.032 33.032 0 1 0-66.064 0Z"
        fill="#464655"
        p-id="1149"
      />
      <path
        d="M693.678 495.484m-33.032 0a33.032 33.032 0 1 0 66.064 0 33.032 33.032 0 1 0-66.064 0Z"
        fill="#464655"
        p-id="1150"
      />
    </svg>
  )
const PandaIcon = props => <Icon component={PandaSvg} {...props} />
var NewsbPageCss  = require('./newsb.css')
export default class NewsbPage extends React.Component{
    render(){
        return(
            <div className={NewsbPageCss.all}>
                <PageHeader
                    style={{border: '1px solid rgb(235,237,240)'}}
                    title="志愿新闻"
                    subTitle="针心针意"
                    extra={[
                        <Link to='./news'> <Button key="1">新闻主页</Button></Link>,
                        <Link to='./login'> <Button key="2">登录</Button></Link>,
                        <PandaIcon style={{ fontSize: '32px' }} />                        
                    ]}
                    />
                    <div className={NewsbPageCss.title}>
                        <p>申城别样“风景线”持续升温 实名注册志愿者人数已达433万</p>
                    </div>
                    <div className={NewsbPageCss.content1}> 
                    <Row>
                        <Col span={5}></Col>
                        <Col span={14}>
                    <h3>                      
                    志愿服务是上海一张靓丽的城市名片。近年来，上海经济社会迅速发展，城市精神文明建设水平持续提高，志愿服务事业也随之不
                    断升温。目前，与全国志愿服务信息系统对接的“上海志愿者网”上，已有实名注册志愿者433万人，占本市常住人口的17%以上，提
                    前完成国家“十三五”规划目标。</h3> 
                    <h3>
                    小区里，垃圾分类志愿者们起早贪黑，用勤劳与责任倡导着城市的“新时尚”；元旦、春节期间，家家户户团聚之时，40万平安志愿
                    者为烟花爆竹管控忙碌；进博会上，面带微笑、热情服务的“小叶子”们，赢得了中外来宾的交口称赞……如今，走出家门，走上街头
                    ，上海志愿者的身影随处可见，志愿服务已成为许多市民认同的一种生活方式和发自内心的价值追求，成为加强公民道德建设、推
                    进精神文明建设的重要载体。</h3>
                    <h2>健全激励保障机制</h2>
                    <h3>
                    6年来，本市志愿服务工作以弘扬和践行社会主义核心价值观为根本，培养时代新人，培育时代新风，坚持围绕中心、服务大局，立
                    足上海城市发展，扎根基层社区、融入日常民生、参与社会治理，实现了新的飞跃。截至本月，全市志愿服务组织已逾2.4万个，市
                    级志愿者服务基地140多家；全市累计发布志愿服务项目28万多个，志愿服务总时长3.48亿小时。</h3>
                    <h3>
                    由市文明办统筹规划协调指导、市志愿者协会联络各方壮大队伍、市志愿服务公益基金会募集资金大力支持的“一体两翼”工作机制，
                    近年来不断健全，开创了志愿服务组织运行体系的新局面，并获中央文明办在全国各省市推广。</h3>
                    <h3>
                    志愿服务制度保障体系也迈上了新台阶。随着《上海市志愿服务条例》今年完成修订，志愿服务的登记管理、资金支持、人才培育、
                    项目运作、监督评估、供需对接、服务记录等配套制度也逐步完善。市志愿服务公益基金会的资金扶持和“关爱好心人”专项基金的困
                    难资助，探索了社会化资金募集渠道。据统计，上海志愿服务公益基金会自2014年成立以来，已资助703个项目，合计1209.8万元；“
                    关爱好心人”专项基金自2013年成立以来，已先后资助受助对象17批456人次，共计发放善款373.85万元。</h3>
                    <h2>志愿服务人人可为</h2>
                    <h3>
                    紧紧围绕人民群众日益增长的美好生活需要，本市坚持互联互通、共建共享，打通宣传群众、教育群众、关心群众、服务群众的“最后
                    一公里”。遍布全市的14家区志愿服务指导中心、220家街（镇）社区志愿服务中心和5000多个居（村）学雷锋志愿服务站，使志愿服
                    务真正来到了每个人身边，变得触手可及。</h3>
                    <h3>
                    依托遍布全市的社区志愿服务中心，本市围绕垃圾分类、服务保障进口博览会、交通文明、河道整治等一系列主题实践活动开展志愿服
                    务工作，推动学雷锋志愿服务深度融入社会治理。36万名志愿者参与了垃圾分类志愿服务项目，成立了垃圾分类志愿者讲师团，在垃圾
                    分类工作中起到了宣传员、引导员、监督员的作用，成为市民家门口的一道别样的“风景线”。
                    </h3>
                    <h3>
                    同时，本市还建立了国内首个雷锋学院，成立上海市志愿服务培训中心，编印《志愿心》和《志愿行》教材，开发面向不同群体的培训
                    课程，不断完善线上线下相衔接、多层次的志愿服务培训体系，如深水静流般不断提升志愿者能力水平，引导人们把学雷锋志愿服务作
                    为生活态度、生活方式和生活习惯，以实际行动提升城市温度。   
                    </h3>
                    <h2 className={NewsbPageCss.footer}>
                    山西晚报记者 马继玲
                    </h2>
                    </Col>
                    </Row>
                    </div>
            </div>
        )
    }
}