import React from 'react'
import {PageHeader,Button,Icon,Row,Col} from 'antd'
import {Link} from 'react-router-dom'

const PandaSvg = () => (
    <svg viewBox="0 0 1024 1024" width="1em" height="1em" fill="currentColor">
      <path
        d="M99.096 315.634s-82.58-64.032-82.58-132.13c0-66.064 33.032-165.162 148.646-148.646 83.37 11.91 99.096 165.162 99.096 165.162l-165.162 115.614zM924.906 315.634s82.58-64.032 82.58-132.13c0-66.064-33.032-165.162-148.646-148.646-83.37 11.91-99.096 165.162-99.096 165.162l165.162 115.614z"
        fill="#6B676E"
        p-id="1143"
      />
      <path
        d="M1024 561.548c0 264.526-229.23 429.42-512.002 429.42S0 826.076 0 561.548 283.96 66.064 512.002 66.064 1024 297.022 1024 561.548z"
        fill="#FFEBD2"
        p-id="1144"
      />
      <path
        d="M330.324 842.126c0 82.096 81.34 148.646 181.678 148.646s181.678-66.55 181.678-148.646H330.324z"
        fill="#E9D7C3"
        p-id="1145"
      />
      <path
        d="M644.13 611.098C594.582 528.516 561.55 512 512.002 512c-49.548 0-82.58 16.516-132.13 99.096-42.488 70.814-78.73 211.264-49.548 247.742 66.064 82.58 165.162 33.032 181.678 33.032 16.516 0 115.614 49.548 181.678-33.032 29.18-36.476-7.064-176.93-49.55-247.74z"
        fill="#FFFFFF"
        p-id="1146"
      />
      <path
        d="M611.098 495.484c0-45.608 36.974-82.58 82.58-82.58 49.548 0 198.194 99.098 198.194 165.162s-79.934 144.904-148.646 99.096c-49.548-33.032-132.128-148.646-132.128-181.678zM412.904 495.484c0-45.608-36.974-82.58-82.58-82.58-49.548 0-198.194 99.098-198.194 165.162s79.934 144.904 148.646 99.096c49.548-33.032 132.128-148.646 132.128-181.678z"
        fill="#6B676E"
        p-id="1147"
      />
      <path
        d="M512.002 726.622c-30.06 0-115.614 5.668-115.614 33.032 0 49.638 105.484 85.24 115.614 82.58 10.128 2.66 115.614-32.944 115.614-82.58-0.002-27.366-85.556-33.032-115.614-33.032z"
        fill="#464655"
        p-id="1148"
      />
      <path
        d="M330.324 495.484m-33.032 0a33.032 33.032 0 1 0 66.064 0 33.032 33.032 0 1 0-66.064 0Z"
        fill="#464655"
        p-id="1149"
      />
      <path
        d="M693.678 495.484m-33.032 0a33.032 33.032 0 1 0 66.064 0 33.032 33.032 0 1 0-66.064 0Z"
        fill="#464655"
        p-id="1150"
      />
    </svg>
  )
const PandaIcon = props => <Icon component={PandaSvg} {...props} />
var NewsdPageCss  = require('./newsd.css')
export default class NewsdPage extends React.Component{
    render(){
        return(
            <div className={NewsdPageCss.all}>
                <PageHeader
                    style={{border: '1px solid rgb(235,237,240)'}}
                    title="志愿新闻"
                    subTitle="针心针意"
                    extra={[
                        <Link to='./news'> <Button key="1">新闻主页</Button></Link>,
                        <Link to='./login'> <Button key="2">登录</Button></Link>,
                        <PandaIcon style={{ fontSize: '32px' }} />                        
                    ]}
                    />
                    <div className={NewsdPageCss.title}>
                        <p>SMG志愿者 | 文明与文化同行 助力长江大保护</p>
                    </div>
                    <div className={NewsdPageCss.content1}> 
                    <Row>
                        <Col span={5}></Col>
                        <Col span={14}>
                    <h3>                      
                    12月20日下午，位于崇明陈家镇的海警码头上格外热闹，由SMG主持人组成的文明实践志愿者队伍迎着寒冷江风，参加增殖放流活
                    动。在专业人员指导下，主持人志愿者们拿起一袋袋胭脂鱼，将它们小心地放入放流槽，一尾尾胭脂鱼随之跃入江水中。一个小时
                    的放流活动中，志愿者们共计放流国家二级保护动物胭脂鱼2000尾，用实际行动助力长江口生态环境保护和修复。</h3> 
                    <h3>
                    放流活动前，为了聚焦绿色发展理念，积极推动促进人与自然和谐共生，建设美丽中国，SMG文明办、上海市水生野生动植物保护研
                    究中心等单位，共同在上海市水生野生动植物保护基地举办“文明与文化同行 助力长江大保护”文明实践志愿服务活动，上海市志愿
                    服务公益基金会，中共上海市委宣传部基层工作处，中共上海崇明区委宣传部、区文明，SMG文明办，上海市水生野生动植物保护研
                    究中心等相关单位负责人出席活动。</h3>
                    <h3>
                    为了向人民群众宣传“绿色发展、生态优先”的理念，SMG文明办聘任十多位知名主持人作为长江口生态保护文明实践志愿者，以期发
                    挥他们自身文化素养以及良好的公众形象起到生态保护引领示范作用。活动还为主持人志愿者们现场颁发了聘书，主持人代表宣读了
                    《守护长江母亲河——文明实践志愿服务倡议书》。</h3>
                    <h2>《守护长江母亲河——文明实践志愿服务倡议书》</h2>
                    <h3>
                    为此，我们向SMG所有志愿者倡议：</h3>
                    <h3>
                    一、饮水思源，做守护长江母亲河的志愿者，从我做起，从现在做起，积极投身“文明与文化同行”行动，争当保护长江母亲河的宣传员
                    ，广泛传播公益主张，更加有效地动员和凝聚各方面力量，影响并带动更多人参与到保护长江的行动中来。</h3>
                    
                    <h3>
                    二、学习环境科普知识，做长江生态大保护的监督者和绿色生活方式的倡导者，及时反映生态隐患和环境风险，对破坏生态环境的行为
                    坚决说“不”，努力营造崇尚生态文明的良好氛围。</h3>
                    <h3>
                    三、依托SMG平台优势，当好信息联络员，与专业保护单位紧密合作，及时保护需要救助的野生动物，为营造全社会共同关注，理解和
                    支持上海珍稀野生水生动物保护的良好氛围，为打响SMG志愿服务品牌，贡献自己的力量。
                    </h3>
                    <h3>
                    在SMG文明办和上海市水生野生动植物保护研究中心的共同推动下，“SMG长江口生态保护文明实践志愿服务点”也在上海水生野生动植物
                    保护基地正式成立，上海市志愿服务公益基金会理事长陈振民、市委宣传部基层工作处处长郑英豪共同为志愿服务点揭牌。依托“文明实
                    践志愿服务点”机制，崇明区、SMG和保护研究中心将加强条块联动、部门协同，合力推进上海新时代文明实践中心建设试点工作，进一步
                    推动“文明与文化同行”志愿服务常态化和制度化，为弘扬志愿服务精神、传播志愿服务文化作出表率。
                    </h3>
                    <h3>为营造良好的网络舆论氛围，线上线下结合开展广泛宣传，SMG文明办还发动主持人志愿者借助自身微博、微信晒出照片，畅谈生态保
                        护感言，向社会公众宣传“绿色发展、生态优先”的理念，打响SMG志愿者品牌。</h3>
                    <h2 className={NewsdPageCss.footer}>
                    来源：SMG思研汇
                    </h2>
                    </Col>
                    </Row>
                    </div>
            </div>
        )
    }
}