import React from 'react'
import {PageHeader,Button,Icon,Row,Col} from 'antd'
import {Link} from 'react-router-dom'

const PandaSvg = () => (
    <svg viewBox="0 0 1024 1024" width="1em" height="1em" fill="currentColor">
      <path
        d="M99.096 315.634s-82.58-64.032-82.58-132.13c0-66.064 33.032-165.162 148.646-148.646 83.37 11.91 99.096 165.162 99.096 165.162l-165.162 115.614zM924.906 315.634s82.58-64.032 82.58-132.13c0-66.064-33.032-165.162-148.646-148.646-83.37 11.91-99.096 165.162-99.096 165.162l165.162 115.614z"
        fill="#6B676E"
        p-id="1143"
      />
      <path
        d="M1024 561.548c0 264.526-229.23 429.42-512.002 429.42S0 826.076 0 561.548 283.96 66.064 512.002 66.064 1024 297.022 1024 561.548z"
        fill="#FFEBD2"
        p-id="1144"
      />
      <path
        d="M330.324 842.126c0 82.096 81.34 148.646 181.678 148.646s181.678-66.55 181.678-148.646H330.324z"
        fill="#E9D7C3"
        p-id="1145"
      />
      <path
        d="M644.13 611.098C594.582 528.516 561.55 512 512.002 512c-49.548 0-82.58 16.516-132.13 99.096-42.488 70.814-78.73 211.264-49.548 247.742 66.064 82.58 165.162 33.032 181.678 33.032 16.516 0 115.614 49.548 181.678-33.032 29.18-36.476-7.064-176.93-49.55-247.74z"
        fill="#FFFFFF"
        p-id="1146"
      />
      <path
        d="M611.098 495.484c0-45.608 36.974-82.58 82.58-82.58 49.548 0 198.194 99.098 198.194 165.162s-79.934 144.904-148.646 99.096c-49.548-33.032-132.128-148.646-132.128-181.678zM412.904 495.484c0-45.608-36.974-82.58-82.58-82.58-49.548 0-198.194 99.098-198.194 165.162s79.934 144.904 148.646 99.096c49.548-33.032 132.128-148.646 132.128-181.678z"
        fill="#6B676E"
        p-id="1147"
      />
      <path
        d="M512.002 726.622c-30.06 0-115.614 5.668-115.614 33.032 0 49.638 105.484 85.24 115.614 82.58 10.128 2.66 115.614-32.944 115.614-82.58-0.002-27.366-85.556-33.032-115.614-33.032z"
        fill="#464655"
        p-id="1148"
      />
      <path
        d="M330.324 495.484m-33.032 0a33.032 33.032 0 1 0 66.064 0 33.032 33.032 0 1 0-66.064 0Z"
        fill="#464655"
        p-id="1149"
      />
      <path
        d="M693.678 495.484m-33.032 0a33.032 33.032 0 1 0 66.064 0 33.032 33.032 0 1 0-66.064 0Z"
        fill="#464655"
        p-id="1150"
      />
    </svg>
  )
const PandaIcon = props => <Icon component={PandaSvg} {...props} />
var NewsfPageCss  = require('./newsf.css')
export default class NewsfPage extends React.Component{
    render(){
        return(
            <div className={NewsfPageCss.all}>
                <PageHeader
                    style={{border: '1px solid rgb(235,237,240)'}}
                    title="志愿新闻"
                    subTitle="针心针意"
                    extra={[
                        <Link to='./news'> <Button key="1">新闻主页</Button></Link>,
                        <Link to='./login'> <Button key="2">登录</Button></Link>,
                        <PandaIcon style={{ fontSize: '32px' }} />                        
                    ]}
                    />
                    <div className={NewsfPageCss.title}>
                        <p>媒体和志愿者携手 共担服务民生使命</p>
                    </div>
                    <div className={NewsfPageCss.content1}> 
                    <Row>
                        <Col span={5}></Col>
                        <Col span={14}>
                    <h3>                      
                    昨日中午，郭明义爱心团队冯永庆工作室的志愿者冯永庆一行，专程来到鞍山广播电视台，给《直播前沿》栏目组送锦旗，以感谢
                    在即将过去的一年里，作为新闻媒体关注群众冷暖，为百姓协调解决实际问题的担当和作为。</h3> 
                    <h3>
                    2008年，冯永庆成为铁东区政府行风义务监督员，从那时起，他就与《直播前沿》结下了不解之缘，“关注民生、贴近群众”的办节目
                    宗旨感染着他。每天《直播前沿》报道的热线节目他都收看，而热线遇到的棘手问题，也会找他帮助协调解决。</h3>
                    
                    <h3>
                    从2003年至今，冯永庆协调处理的民生问题已达万件，现在已年逾古稀的他，每天仍马不停蹄地奔走在鞍山的大街小巷，为群众排忧
                    解难，与新闻媒体共同承担起服务民生的社会责任和使命。</h3>
                    
                    <h2 className={NewsfPageCss.footer}>
                    记者：李南依、曹鹏略 鞍山广播电视台
                    </h2>
                    </Col>
                    </Row>
                    </div>
            </div>
        )
    }
}