import React from 'react'
import {PageHeader,Button,Icon,Row,Col} from 'antd'
import {Link} from 'react-router-dom'

const PandaSvg = () => (
    <svg viewBox="0 0 1024 1024" width="1em" height="1em" fill="currentColor">
      <path
        d="M99.096 315.634s-82.58-64.032-82.58-132.13c0-66.064 33.032-165.162 148.646-148.646 83.37 11.91 99.096 165.162 99.096 165.162l-165.162 115.614zM924.906 315.634s82.58-64.032 82.58-132.13c0-66.064-33.032-165.162-148.646-148.646-83.37 11.91-99.096 165.162-99.096 165.162l165.162 115.614z"
        fill="#6B676E"
        p-id="1143"
      />
      <path
        d="M1024 561.548c0 264.526-229.23 429.42-512.002 429.42S0 826.076 0 561.548 283.96 66.064 512.002 66.064 1024 297.022 1024 561.548z"
        fill="#FFEBD2"
        p-id="1144"
      />
      <path
        d="M330.324 842.126c0 82.096 81.34 148.646 181.678 148.646s181.678-66.55 181.678-148.646H330.324z"
        fill="#E9D7C3"
        p-id="1145"
      />
      <path
        d="M644.13 611.098C594.582 528.516 561.55 512 512.002 512c-49.548 0-82.58 16.516-132.13 99.096-42.488 70.814-78.73 211.264-49.548 247.742 66.064 82.58 165.162 33.032 181.678 33.032 16.516 0 115.614 49.548 181.678-33.032 29.18-36.476-7.064-176.93-49.55-247.74z"
        fill="#FFFFFF"
        p-id="1146"
      />
      <path
        d="M611.098 495.484c0-45.608 36.974-82.58 82.58-82.58 49.548 0 198.194 99.098 198.194 165.162s-79.934 144.904-148.646 99.096c-49.548-33.032-132.128-148.646-132.128-181.678zM412.904 495.484c0-45.608-36.974-82.58-82.58-82.58-49.548 0-198.194 99.098-198.194 165.162s79.934 144.904 148.646 99.096c49.548-33.032 132.128-148.646 132.128-181.678z"
        fill="#6B676E"
        p-id="1147"
      />
      <path
        d="M512.002 726.622c-30.06 0-115.614 5.668-115.614 33.032 0 49.638 105.484 85.24 115.614 82.58 10.128 2.66 115.614-32.944 115.614-82.58-0.002-27.366-85.556-33.032-115.614-33.032z"
        fill="#464655"
        p-id="1148"
      />
      <path
        d="M330.324 495.484m-33.032 0a33.032 33.032 0 1 0 66.064 0 33.032 33.032 0 1 0-66.064 0Z"
        fill="#464655"
        p-id="1149"
      />
      <path
        d="M693.678 495.484m-33.032 0a33.032 33.032 0 1 0 66.064 0 33.032 33.032 0 1 0-66.064 0Z"
        fill="#464655"
        p-id="1150"
      />
    </svg>
  )
const PandaIcon = props => <Icon component={PandaSvg} {...props} />
var NewscPageCss  = require('./newsc.css')
export default class NewscPage extends React.Component{
    render(){
        return(
            <div className={NewscPageCss.all}>
                <PageHeader
                    style={{border: '1px solid rgb(235,237,240)'}}
                    title="志愿新闻"
                    subTitle="针心针意"
                    extra={[
                        <Link to='./news'> <Button key="1">新闻主页</Button></Link>,
                        <Link to='./login'> <Button key="2">登录</Button></Link>,
                        <PandaIcon style={{ fontSize: '32px' }} />                        
                    ]}
                    />
                    <div className={NewscPageCss.title}>
                        <p>羡慕，这7位大学生志愿者要去联合国工作了</p>
                    </div>
                    <div className={NewscPageCss.content1}> 
                    <Row>
                        <Col span={5}></Col>
                        <Col span={14}>
                    <h2>中国青年志愿者海外服务计划——服务联合国机构项目首批志愿者出征啦！</h2>
                    <h3>                      
                    12月19日，中国青年志愿者海外服务计划——服务联合国机构项目首批志愿者出征仪式在上海外国语大学举行。</h3> 
                    <h3>
                    团中央青年志愿者行动指导中心党委委员熊剑为志愿者代表授旗并讲话。联合国志愿人员组织亚太区域副主任玛农·贝尼耶通过视频
                    为首批志愿者送行。联合国志愿人员组织中国办公室主任张楠、项目首批参与高校团委负责同志参加出征仪式。</h3>
                    <h3>为更好地服务国家战略和党政外交大局，组织和引领当代中国青年跟着习近平总书记走出去，在海外志愿服务实践中学习宣传习
                    近平新时代中国特色社会主义思想，增强“四个自信”、做到“两个维护”，中国青年志愿者协会与联合国志愿人员组织合作实施中
                    国青年志愿者海外服务计划——服务联合国机构项目，选派中国青年志愿者赴联合国机构特别是驻“一带一路”沿线国家相关机构开
                    展国际志愿服务。</h3>
                    <h3>
                    这一项目是学习贯彻落实习近平总书记“推动构建人类命运共同体”重要思想和推进“一带一路”建设的实践载体，是“发出中国声音、
                    讲好中国故事、助推中国文化、贡献中国力量”的重要途径，是中国青年志愿者走向国际、承担使命、展现中国青年风采的生动体现。</h3>
                    <h3>
                    项目首批7名大学生志愿者分别来自上海外国语大学、南京大学、浙江大学、江西师范大学、武汉大学、中山大学和重庆大学等7所高校
                    ，经过联合国有关机构笔试面试等程序严格选拔产生，将于近日前往老挝、缅甸、泰国、印度、土耳其、美国等国家的联合国机构服务。</h3>
                    <h3>
                    12月16日至19日，中国青年志愿者协会、联合国志愿人员组织开展了志愿者行前集中培训。志愿者在国际资深培训师Vojislava Tomc 
                    Radivojsa的带领下，以提升领导力为核心，进行了自我认知、表达技巧、团队合作、情景演练、案例分析等方面的培训。</h3>
                    <h3>志愿者纷纷表示，通过培训对自我有了全新的认识，对如何更好地在联合国机构语境下进行团队合作有了更成熟的想法。上海外国语
                    大学教授杨成为志愿者作了外交外事方面的讲座。志愿者还集体前往上海渔阳里团中央旧址纪念馆重温团的初心，以更好传承中国青年卓
                    越为公、开拓进取的精神。</h3>
                    <h2 className={NewscPageCss.footer}>
                    来源： 中国青年志愿者微信平台 
                    </h2>
                    </Col>
                    </Row>
                    </div>
            </div>
        )
    }
}