import React from 'react'
import {PageHeader,Button,Icon,Row,Col} from 'antd'
import {Link} from 'react-router-dom'

const PandaSvg = () => (
    <svg viewBox="0 0 1024 1024" width="1em" height="1em" fill="currentColor">
      <path
        d="M99.096 315.634s-82.58-64.032-82.58-132.13c0-66.064 33.032-165.162 148.646-148.646 83.37 11.91 99.096 165.162 99.096 165.162l-165.162 115.614zM924.906 315.634s82.58-64.032 82.58-132.13c0-66.064-33.032-165.162-148.646-148.646-83.37 11.91-99.096 165.162-99.096 165.162l165.162 115.614z"
        fill="#6B676E"
        p-id="1143"
      />
      <path
        d="M1024 561.548c0 264.526-229.23 429.42-512.002 429.42S0 826.076 0 561.548 283.96 66.064 512.002 66.064 1024 297.022 1024 561.548z"
        fill="#FFEBD2"
        p-id="1144"
      />
      <path
        d="M330.324 842.126c0 82.096 81.34 148.646 181.678 148.646s181.678-66.55 181.678-148.646H330.324z"
        fill="#E9D7C3"
        p-id="1145"
      />
      <path
        d="M644.13 611.098C594.582 528.516 561.55 512 512.002 512c-49.548 0-82.58 16.516-132.13 99.096-42.488 70.814-78.73 211.264-49.548 247.742 66.064 82.58 165.162 33.032 181.678 33.032 16.516 0 115.614 49.548 181.678-33.032 29.18-36.476-7.064-176.93-49.55-247.74z"
        fill="#FFFFFF"
        p-id="1146"
      />
      <path
        d="M611.098 495.484c0-45.608 36.974-82.58 82.58-82.58 49.548 0 198.194 99.098 198.194 165.162s-79.934 144.904-148.646 99.096c-49.548-33.032-132.128-148.646-132.128-181.678zM412.904 495.484c0-45.608-36.974-82.58-82.58-82.58-49.548 0-198.194 99.098-198.194 165.162s79.934 144.904 148.646 99.096c49.548-33.032 132.128-148.646 132.128-181.678z"
        fill="#6B676E"
        p-id="1147"
      />
      <path
        d="M512.002 726.622c-30.06 0-115.614 5.668-115.614 33.032 0 49.638 105.484 85.24 115.614 82.58 10.128 2.66 115.614-32.944 115.614-82.58-0.002-27.366-85.556-33.032-115.614-33.032z"
        fill="#464655"
        p-id="1148"
      />
      <path
        d="M330.324 495.484m-33.032 0a33.032 33.032 0 1 0 66.064 0 33.032 33.032 0 1 0-66.064 0Z"
        fill="#464655"
        p-id="1149"
      />
      <path
        d="M693.678 495.484m-33.032 0a33.032 33.032 0 1 0 66.064 0 33.032 33.032 0 1 0-66.064 0Z"
        fill="#464655"
        p-id="1150"
      />
    </svg>
  )
const PandaIcon = props => <Icon component={PandaSvg} {...props} />
var NewsaPageCss  = require('./newsa.css')
export default class NewsaPage extends React.Component{
    render(){
        return(
            <div className={NewsaPageCss.all}>
                <PageHeader
                    style={{border: '1px solid rgb(235,237,240)'}}
                    title="志愿新闻"
                    subTitle="针心针意"
                    extra={[
                        <Link to='/user/news'> <Button key="1">新闻主页</Button></Link>,
                        <Link to='/user/login'> <Button key="2">登录</Button></Link>,
                        <PandaIcon style={{ fontSize: '32px' }} />                        
                    ]}
                    />
                    <div className={NewsaPageCss.title}>
                        <p>志愿者争相报名 一针一线传递温暖</p>
                    </div>
                    <div className={NewsaPageCss.content1}> 
                    <Row>
                        <Col span={5}></Col>
                        <Col span={14}>
                    <h3>                      
                    编织一份爱，传递一份暖。山西晚报联合阿里巴巴天天正能量及全国22家媒体开展的2019“针心针意”大型暖冬公益行动正在进行。
                    12月26日下午，活动首站走进太原市小店区营盘街道南内环街二社区，一百多平方米的活动室内人头攒动，来自辖区的六七十位志
                    愿者加入到为贫困山区留守孩子编织温暖的爱心行动中，她们中年龄最大的70岁，最小的17岁，无论是编织高手，还是现学编织的
                    年轻人，都是爱心爆棚。</h3> 
                    <h3>
                    志愿者们领到毛线后，不禁感叹，“这线质量真不错”“中粗线，好织”“娃娃们围上一定漂亮又暖和”。各自找到座位，请教高手，很
                    快现场就安静下来，一团团线在编织高手指尖翻飞灵动。“爱花，你给看看，我这个起针行不行？”“爱花，围巾到底打多宽呀？”在
                    活动现场，热心居民喊“爱花”的声音此起彼伏。52岁的刘爱花，是南内环二社区的编织高手，活动刚开始，她已经利索地为围巾起
                    了头，双手上下翻飞，嘴巴也没闲着，技术指导身边的姐妹们织围巾针法。刘爱花说，给孩子们织围巾，宽度最好在30厘米左右，
                    围巾还要足够长，这样孩子们能在脖子上绕一圈。她使用的是搓板针，这种针法打出来的围巾，厚实还紧密，围起来暖和。</h3>
                    <h3>
                    “知道今天是献爱心的活动，我83岁的婆婆催着我来！”刘爱花说，活动当天上午，她和爱人带着83岁的婆婆去晋阳湖游玩，中午仨
                    人在晋阳湖周边吃了口饭，筷子还没落下，婆婆就催她回家，生怕误了下午的活动。“今天晚上，我加班也得把这条围巾编织好了！
                    ”刘爱花笑着说：“这是大好事儿，一定支持。咱就盼着孩子们早一天围上这围巾！”</h3>
                    <h3>
                    除了南内环二社区的志愿者外，还来了不少营盘街道兄弟社区的志愿者们。东岗二社区的90后魏智霞和两个同事，早早组团来参加
                    活动。还有平阳二社区的志愿者宋爱丽、长治路二社区的高艾莲，太原市36中的老师等。</h3>
                    <h3>
                    南内环二社区副书记杜增辉说，活动很有意义，他分别在营盘街道志愿者群、南内环二社区志愿者群发布了信息，接龙参加活动的
                    志愿者达到了60余人，不仅有热心居民，还有学校老师、医生等上班族也要加入其中。为了活动顺利进行，社区工作人员25日晚特
                    地加班把线团五个一团分装到小袋里。</h3>
                    <h3>
                    一针一线都是爱的汇聚，山西晚报联合阿里巴巴天天正能量的“针心针意”活动除了线上编织活动外，还有“H5公益互动小游戏”，根
                    据H5页面显示，网友可以根据自己的喜好，为留守儿童“绘制”围巾，并写下祝福语，转发到朋友圈中。</h3>
                    <h2 className={NewsaPageCss.footer}>
                    山西晚报记者 马继玲
                    </h2>
                    </Col>
                    </Row>
                    </div>
            </div>
        )
    }
}